{"tree_inv": "La postura de yoga tree_inv se realizó en forma correcta, ya que las diferencias entre los ángulos óptimos y los ángulos medidos medios son mínimas. Sin embargo, se puede sugerir realizar algunas correcciones para perfeccionar la postura.\n\nEn la cadera derecha, el ángulo medido medio es ligeramente mayor al ángulo óptimo. Para mejorar esto, se recomienda prestar atención a la alineación de la cadera y asegurarse de mantenerla nivelada durante la postura.\n\nEn la cadera izquierda, el ángulo medido medio es mayor al ángulo óptimo. Para corregir esto, se sugiere trabajar en el equilibrio de ambas caderas, distribuyendo el peso de manera uniforme en ambos pies.\n\nEn la rodilla derecha, el ángulo medido medio es ligeramente mayor al ángulo óptimo. Para evitar posibles lesiones en la rodilla, se aconseja prestar atención a la alineación y asegurarse de mantenerla alineada con el pie durante la postura.\n\nRecuerda que el yoga es un proceso de aprendizaje y cada cuerpo es único. Sigue practicando con conciencia y escucha tu cuerpo para obtener los mejores resultados en tu práctica de yoga.", "tree": "En general, la postura de yoga tree parece estar bien realizada. La cadera izquierda tiene un ángulo medido medio de 174, que es el mismo que el ángulo óptimo, lo cual indica una buena alineación en esa parte del cuerpo. La cadera derecha tiene una diferencia de 8 grados entre el ángulo óptimo y el ángulo medido medio, lo cual es aceptable y no requiere una corrección significativa. \n\nSin embargo, la rodilla derecha muestra una diferencia de 18 grados entre el ángulo óptimo y el ángulo medido medio. Esto indica que podría haber una ligera falta de alineación en esa parte del cuerpo. Te sugiero prestar atención a la posición de tu rodilla derecha y asegurarte de mantenerla alineada con el pie y la cadera. Intenta ajustar la posición de la rodilla para reducir esa diferencia y mejorar la postura.\n\nRecuerda siempre escuchar a tu cuerpo y no forzar ninguna posición. Si sientes alguna molestia o incomodidad, modifica la postura para adaptarla a tus necesidades. Continúa practicando y disfrutando de tu práctica de yoga. ¡Namaste!", "warrior": "La postura de yoga Warrior parece haber sido realizada correctamente en general, pero hay algunas áreas que podrían mejorarse. \n\nEn cuanto al codo derecho e izquierdo, los ángulos medidos medios están muy cerca del ángulo óptimo, lo cual es excelente. Sin embargo, si deseas perfeccionar aún más la postura, puedes intentar mantener los codos un poco más rectos para obtener una alineación aún mejor.\n\nLa cadera derecha muestra una diferencia de 31 grados entre el ángulo óptimo y el ángulo medido medio. Esto indica que hay margen de mejora. Intenta enfocarte en fortalecer y estirar los músculos de la cadera para lograr una mayor estabilidad y alineación.\n\nLa cadera izquierda también tiene una diferencia de 14 grados, lo que sugiere que puedes trabajar en la alineación de esta área. Trata de mantener las caderas más niveladas y equilibradas durante la postura.\n\nLos hombros derecho e izquierdo muestran una diferencia de 10 y 17 grados respectivamente. Para mejorar la postura, concéntrate en abrir el pecho y llevar los hombros hacia atrás y hacia abajo. Esto ayudará a fortalecer los músculos de los hombros y a mantener una alineación adecuada.\n\nLa rodilla derecha muestra una diferencia de 26 grados, lo cual indica que puedes trabajar en la estabilidad y la fuerza de esta articulación. Asegúrate de alinear correctamente la rodilla con el pie y de mantenerla estable durante la postura.\n\nEn general, la postura de Warrior está bien realizada, pero siempre hay margen de mejora. Recuerda escuchar a tu cuerpo y trabajar en estos aspectos para perfeccionar aún más tu práctica de yoga.", "warrior_inv": "¡Felicitaciones por practicar la postura de yoga Warrior Invirted! En general, tus ángulos se encuentran bastante cerca de los valores óptimos, lo cual es muy bueno. Sin embargo, hay algunas áreas que podrías mejorar.\n\nEn primer lugar, tu cadera izquierda tiene una diferencia de 14 grados con respecto al ángulo óptimo. Intenta llevarla un poco más hacia atrás para lograr una mayor alineación.\n\nPor otro lado, tus rodillas derecha e izquierda tienen una diferencia de 6 y 3 grados respectivamente con respecto a los ángulos óptimos. Intenta mantenerlas más estables y en línea con tus tobillos para evitar cualquier tensión innecesaria.\n\nEn cuanto a tus codos, tanto el derecho como el izquierdo están muy cerca de los ángulos óptimos, así que sigue manteniéndolos así.\n\nPor último, tus hombros derecho e izquierdo tienen una diferencia de 4 y 6 grados respectivamente con respecto a los ángulos óptimos. Intenta relajar los hombros y llevarlos hacia abajo y hacia atrás para lograr una mayor apertura en el pecho.\n\nRecuerda siempre escuchar a tu cuerpo y no forzar ninguna postura. Realiza los ajustes necesarios para encontrar tu equilibrio y comodidad. ¡Sigue practicando y disfruta de los beneficios físicos y mentales del yoga!", "goddess": "En general, la postura de yoga Goddess se realizó de manera correcta. Sin embargo, se observa que las caderas están ligeramente más abiertas de lo óptimo, con una diferencia de aproximadamente 10 grados en promedio. Para mejorar, te sugiero enfocarte en mantener las caderas alineadas con el ángulo ideal de 108 grados. Puedes trabajar en fortalecer los músculos de la cadera y practicar ejercicios de estiramiento específicos para esa área.\n\nEn cuanto a las rodillas, se mantuvieron en el ángulo óptimo de 114 grados, lo cual es excelente. Continúa prestando atención a mantener esa alineación y evita forzar las rodillas hacia adentro o hacia afuera.\n\nRecuerda que cada cuerpo es único y puede tener pequeñas variaciones en las posturas de yoga. Lo más importante es escuchar a tu cuerpo, respetar sus límites y buscar siempre un equilibrio entre el esfuerzo y la relajación. ¡Sigue practicando con conciencia y disfruta de los beneficios físicos y mentales que el yoga tiene para ofrecerte!", "downdog": "La postura de downdog parece estar siendo realizada correctamente en general, ya que la diferencia entre los valores medios medidos y los valores óptimos es mínima en todas las partes del cuerpo.\n\nEn cuanto al codo izquierdo, el ángulo promedio medido es ligeramente mayor al ángulo óptimo, pero la diferencia es muy pequeña. Sugeriría prestar atención a mantener el codo ligeramente flexionado para evitar la tensión innecesaria.\n\nEn la cadera izquierda, el ángulo promedio medido es ligeramente menor al ángulo óptimo, pero nuevamente la diferencia es mínima. Para mejorar, se podría enfocar en mantener la cadera bien alineada y trabajar en la apertura de la cadera para lograr una mayor flexibilidad.\n\nEn el hombro izquierdo, el ángulo promedio medido es nuevamente muy similar al ángulo óptimo, por lo que la postura parece estar correctamente realizada. Se podría sugerir centrarse en mantener los hombros relajados y evitar la tensión en esa área.\n\nEn resumen, la postura de downdog parece estar bien realizada, con solo pequeñas sugerencias de mejora en la flexión del codo izquierdo y la apertura de la cadera izquierda. Recuerda siempre escuchar a tu cuerpo y realizar los ajustes necesarios para evitar lesiones y obtener los máximos beneficios de la práctica de yoga."}